In [1]:
import os 
import numpy as np 
import pandas as pd 

import sqlalchemy as sa
import pymysql

In [4]:
import sqlalchemy as sa
from sqlalchemy.orm import sessionmaker
from sqlalchemy.exc import SQLAlchemyError
from sqlalchemy.pool import QueuePool

def create_mysql_engine(username, password, host, port, database):
    """
    Create a MySQL engine with advanced features.
    """
    database_url = f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}"
    
    # Use QueuePool for connection pooling
    engine = sa.create_engine(database_url, poolclass=QueuePool, pool_pre_ping=True)

    return engine

def connect_to_database(engine):
    """
    Connect to the database and return a session object.
    """
    Session = sessionmaker(bind=engine)
    session = Session()
    return session

def close_database_connection(session):
    """
    Close the database connection.
    """
    session.close()

# Replace these with your actual database connection details
username = "root"
password = "nagesh"
host = "127.0.0.1"
port = 3306
database_name = "db"

try:
    # Create MySQL engine
    engine = create_mysql_engine(username, password, host, port, database_name)

    # Connect to the database
    session = connect_to_database(engine)

    # Execute your queries or operations here

except SQLAlchemyError as e:
    print(f"Error connecting to the database: {e}")

finally:
    # Close the database connection
    if 'session' in locals():
        close_database_connection(session)

In [7]:
engine

Engine(mysql+pymysql://root:***@127.0.0.1:3306/db)

# Dimension Tables

In [22]:
timedimension_df = pd.read_sql_table('timedimension',engine)
timedimension_df

   TimeID   SaleDate  Month  Quarter  Year
0       1 2024-01-15      1        1  2024
1       2 2024-02-22      2        1  2024
2       3 2024-03-10      3        1  2024

In [23]:
customerdimension_df = pd.read_sql_table('customerdimension',engine)
customerdimension_df

   CustomerID CustomerName         City
0         101     John Doe     New York
1         102   Jane Smith  Los Angeles
2         103  Bob Johnson      Chicago

In [24]:
productdimension_df = pd.read_sql_table('productdimension',engine)
productdimension_df

   ProductID ProductName     Category
0          1      Laptop  Electronics
1          2     T-shirt      Apparel
2          3   Bookshelf    Furniture

# Fact table

In [25]:
SalesFact_df = pd.read_sql_table('salesfact',engine)
SalesFact_df

   SaleID  TimeID  ProductID  CustomerID  QuantitySold  Revenue
0       1       1          1         101             5  1500.00
1       2       2          2         102             3    45.99
2       3       3          3         103             2   120.50

# Cube

-- Creating a simplified cube with dimensions and measures
CREATE TABLE SalesCube AS
SELECT
    s.SaleID,
    t.Year,
    t.Quarter,
    t.Month,
    p.Category AS ProductCategory,
    p.ProductName,
    c.City AS CustomerCity,
    s.QuantitySold,
    s.Revenue
FROM
    SalesFact s
JOIN
    TimeDimension t ON s.TimeID = t.TimeID
JOIN
    ProductDimension p ON s.ProductID = p.ProductID
JOIN
    CustomerDimension c ON s.CustomerID = c.CustomerID;

In [26]:
sales_cube_df = pd.read_sql_table('salescube',engine)
sales_cube_df

,SaleID,Year,Quarter,Month,ProductCategory,ProductName,CustomerCity,QuantitySold,Revenue
0,1,2024,1,1,Electronics,Laptop,New York,5,1500.00
1,2,2024,1,2,Apparel,T-shirt,Los Angeles,3,45.99
2,3,2024,1,3,Furniture,Bookshelf,Chicago,2,120.50

# Run Queries

In [18]:
pd.read_sql_query("""SELECT
    Year,
    ProductCategory,
    SUM(Revenue) AS TotalRevenue
FROM
    SalesCube
GROUP BY
    Year, ProductCategory;""",engine)

   Year ProductCategory  TotalRevenue
0  2024     Electronics       1500.00
1  2024         Apparel         45.99
2  2024       Furniture        120.50

In [19]:
pd.read_sql_query("""SELECT
    quarter,
    ProductCategory,
    SUM(Revenue) AS TotalRevenue
FROM
    SalesCube
GROUP BY
    quarter, ProductCategory;""",engine)

   quarter ProductCategory  TotalRevenue
0        1     Electronics       1500.00
1        1         Apparel         45.99
2        1       Furniture        120.50

In [27]:
pd.read_sql_query("""SELECT
    quarter,
    ProductCategory,
    SUM(QuantitySold) AS QuantitySold
FROM
    SalesCube
GROUP BY
    quarter, ProductCategory;""",engine)

   quarter ProductCategory  QuantitySold
0        1     Electronics           5.0
1        1         Apparel           3.0
2        1       Furniture           2.0